driver-tests/bpelse/POJOCalls/testXPathApplication/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:typeA xmlns:msgns="http://localhost/Synchronous/Synchronous" xmlns:ns1="http://xml.netbeans.org/schema/Synchronous">
      <ns1:paramA>Hello, Synchronous World! + 3.0</ns1:paramA>
    </ns1:typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
