driver-tests/bpelse/faulthandling/faultMsg/faultMsgApplication/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Body>
    <ns1:typeA xmlns:msgns="http://localhost/Synchronous/Synchronous" xmlns:ns1="http://xml.netbeans.org/schema/Synchronous">
      <ns1:paramA>BPCOR-6135: A fault was not handled in the process scope; Fault Name is {http://enterprise.netbeans.org/bpel/TestSystemFault/AnotherService}userFault; Fault Data is &lt;?xml version="1.0" encoding="UTF-8"?&gt;&lt;jbi:message xmlns:msgns="http://j2ee.netbeans.org/wsdl/TestSystemFault/AnotherService" type="msgns:AnotherServiceOperationResponse" version="1.0" xmlns:jbi="http://java.sun.com/xml/ns/jbi/wsdl-11-wrapper"&gt;&lt;jbi:part&gt;In Fault handler:  BPCOR-6177: attempt to access the value of an uninitialized variable "Variable1"&lt;/jbi:part&gt;&lt;/jbi:message&gt;. Sending errors for the pending requests in the process scope before terminating the process instance</ns1:paramA>
    </ns1:typeA>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
